tap "algolia/algolia-cli"
tap "ddev/ddev"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "mongodb/brew"
tap "pantheon-systems/external"
tap "sst/tap"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# OpenType text shaping engine
brew "harfbuzz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# NaCl networking and cryptography library
brew "libsodium"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Platform built on V8 to build network applications
brew "node"
# Contentful command-line tools
brew "contentful-cli"
# Load/unload environment variables based on $PWD
brew "direnv"
# Terminal visual disk space navigator
brew "diskonaut"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line tools for fly.io services
brew "flyctl"
# X11 implementation of the Remote Desktop Protocol (RDP)
brew "freerdp"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Manage your Java environment
brew "jenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Development kit for the Java programming language
brew "openjdk@17"
# Tool for managing events and logs
brew "logstash"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# GUI for vim, made for macOS
brew "macvim"
# Java-based project management
brew "maven"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Command-line collection runner for Postman
brew "newman"
# HTTP/2 C Library
brew "nghttp2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Platform built on V8 to build network applications
brew "node@14"
# Platform built on V8 to build network applications
brew "node@16"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Web-based PostgreSQL database browser
brew "pgweb"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Object-relational database system
brew "postgresql@14"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc", link: false
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Convert between any document format supported by OpenOffice
brew "unoconv"
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Algolia CLI utility
brew "algolia/algolia-cli/algolia"
# DDEV
brew "ddev/ddev/ddev"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Terminus is Pantheon's Command-line Interface (CLI)
brew "pantheon-systems/external/terminus"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Multi-track audio editor and recorder
cask "audacity"
# Developer platform
cask "dotnet-sdk"
# Eclipse integrated development environment
cask "eclipse-ide"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Personal data manager focusing on security
cask "keepassx"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Screen capture tool with mark up and sharing features
cask "skitch"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Break time reminder app
cask "stretchly"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
vscode "42crunch.vscode-openapi"
vscode "alefragnani.bookmarks"
vscode "alexkrechik.cucumberautocomplete"
vscode "andrewbutson.vscode-openapi-viewer"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "chenxsan.vscode-standardjs"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jspolancor.presentationmode"
vscode "kumar-harsh.graphql-for-vscode"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.kotlin"
vscode "miclo.sort-typescript-imports"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "moshfeu.compare-folders"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "octref.vetur"
vscode "pawelgrzybek.gatito-theme"
vscode "philosowaffle.openapi-designer"
vscode "piotr-porzuczek.jest-cucumber-code-generator-extension"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "standard.vscode-standard"
vscode "streetsidesoftware.avro"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "uctakeoff.vscode-counter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wayou.vscode-todo-highlight"
vscode "znck.grammarly"
