tap "algolia/algolia-cli"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
brew "python@3.9"
brew "harfbuzz"
brew "zstd"
brew "ant"
brew "jpeg-xl"
brew "python@3.11"
brew "docutils"
brew "awscli", link: false
brew "bat"
brew "cmake"
brew "curl"
brew "direnv"
brew "diskonaut"
brew "docker", link: false
brew "dos2unix"
brew "erlang"
brew "elixir"
brew "unbound"
brew "gnutls"
brew "libarchive"
brew "libass"
brew "libsodium"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "flyctl"
brew "openssl@3", link: false
brew "freerdp", link: false
brew "freetds"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "libheif"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "logstash"
brew "lsd"
brew "ruby"
brew "macvim"
brew "maven"
brew "node@16"
brew "mongosh"
brew "mongodb-atlas-cli"
brew "node"
brew "newman"
brew "nghttp2"
brew "python@3.10"
brew "node@14"
brew "nvm"
brew "pandoc"
brew "pgweb"
brew "php"
brew "pnpm"
brew "qemu"
brew "podman"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tcl-tk", link: false
brew "python@3.8"
brew "redis"
brew "sphinx-doc"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "unoconv"
brew "wget"
brew "yarn"
brew "zlib"
brew "algolia/algolia-cli/algolia"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-community"
cask "docker"
cask "dotnet-sdk"
cask "google-cloud-sdk"
cask "intellij-idea-ce"
cask "iterm2"
cask "keepassx"
cask "keepassxc"
cask "mactex"
cask "mysqlworkbench"
cask "ngrok"
cask "numi"
cask "postman"
cask "skitch"
cask "slack"
cask "spectacle"
cask "spotify"
cask "stretchly"
cask "tableplus"
cask "visual-studio-code"
cask "vlc"
vscode "42Crunch.vscode-openapi"
vscode "alefragnani.Bookmarks"
vscode "alexkrechik.cucumberautocomplete"
vscode "apollographql.vscode-apollo"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "chenxsan.vscode-standardjs"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "jspolancor.presentationmode"
vscode "kumar-harsh.graphql-for-vscode"
vscode "marp-team.marp-vscode"
vscode "mathiasfrohlich.Kotlin"
vscode "miclo.sort-typescript-imports"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "octref.vetur"
vscode "pawelgrzybek.gatito-theme"
vscode "philosowaffle.openapi-designer"
vscode "piotr-porzuczek.jest-cucumber-code-generator-extension"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.avro"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-concourse"
vscode "vmware.vscode-manifest-yaml"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vstirbu.vscode-mermaid-preview"
vscode "wayou.vscode-todo-highlight"
vscode "znck.grammarly"
